# CancellationListener Properties

---
The CancellationListener type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
CancellationListener Class
Autodesk.Revit.DB Namespace